

#ifndef WKJELLYWORM_CTASKSPRITEANIMATION_H
#define WKJELLYWORM_CTASKSPRITEANIMATION_H


#include "../CTask.h"

class CTaskSpriteAnimation : public CTask {
public:
	int unknown30; // 0x30
	int unknown34; // 0x34
	int unknown38; // 0x38
	int unknown3C; // 0x3C
	int unknown40; // 0x40
	int unknown44; // 0x44
	int unknown48; // 0x48
	int unknown4C; // 0x4C
	int unknown50; // 0x50
	int unknown54; // 0x54
	int unknown58; // 0x58
	int unknown5C; // 0x5C
	int unknown60; // 0x60
	int unknown64; // 0x64
	int unknown68; // 0x68
	int unknown6C; // 0x6C
	int unknown70; // 0x70
	int unknown74; // 0x74
	int unknown78; // 0x78
	int unknown7C; // 0x7C
	int unknown80; // 0x80
	int unknown84; // 0x84
	int unknown88; // 0x88
	int unknown8C; // 0x8C
	int unknown90; // 0x90
	int unknown94; // 0x94
	int unknown98; // 0x98
	int unknown9C; // 0x9C
	int unknownA0; // 0xA0
	int unknownA4; // 0xA4
	int unknownA8; // 0xA8
	int unknownAC; // 0xAC
	int unknownB0; // 0xB0
	int unknownB4; // 0xB4
	int unknownB8; // 0xB8
	int unknownBC; // 0xBC
	int unknownC0; // 0xC0
	int unknownC4; // 0xC4
	int unknownC8; // 0xC8
	int unknownCC; // 0xCC
	int unknownD0; // 0xD0
	int unknownD4; // 0xD4
	int unknownD8; // 0xD8
	int unknownDC; // 0xDC
	int unknownE0; // 0xE0
	int unknownE4; // 0xE4
	int unknownE8; // 0xE8
	int unknownEC; // 0xEC
	int unknownF0; // 0xF0
	int unknownF4; // 0xF4
	int unknownF8; // 0xF8
	int unknownFC; // 0xFC
	int unknown100; // 0x100
	int unknown104; // 0x104
	int unknown108; // 0x108
	int unknown10C; // 0x10C
	int unknown110; // 0x110
	int unknown114; // 0x114
	int unknown118; // 0x118
	int unknown11C; // 0x11C
	int unknown120; // 0x120
	int unknown124; // 0x124
	int unknown128; // 0x128
	int unknown12C; // 0x12C
	int unknown130; // 0x130
	int unknown134; // 0x134
	int unknown138; // 0x138
	int unknown13C; // 0x13C
	int unknown140; // 0x140
	int unknown144; // 0x144
	int unknown148; // 0x148
	int unknown14C; // 0x14C
	int unknown150; // 0x150
	int unknown154; // 0x154
	int unknown158; // 0x158
	int unknown15C; // 0x15C
	int unknown160; // 0x160
	int unknown164; // 0x164
	int unknown168; // 0x168
	int unknown16C; // 0x16C
	int unknown170; // 0x170
	int unknown174; // 0x174
	int unknown178; // 0x178
	int unknown17C; // 0x17C
	int unknown180; // 0x180
	int unknown184; // 0x184
	int unknown188; // 0x188
	int unknown18C; // 0x18C
	int unknown190; // 0x190
	int unknown194; // 0x194
	int unknown198; // 0x198
	int unknown19C; // 0x19C
	int unknown1A0; // 0x1A0
	int unknown1A4; // 0x1A4
	int unknown1A8; // 0x1A8
	int unknown1AC; // 0x1AC
	int unknown1B0; // 0x1B0
	int unknown1B4; // 0x1B4
	int unknown1B8; // 0x1B8
	int unknown1BC; // 0x1BC
	int unknown1C0; // 0x1C0
	int unknown1C4; // 0x1C4
	int unknown1C8; // 0x1C8
	int unknown1CC; // 0x1CC
	int unknown1D0; // 0x1D0
	int unknown1D4; // 0x1D4
	int unknown1D8; // 0x1D8
	int unknown1DC; // 0x1DC
	int unknown1E0; // 0x1E0
	int unknown1E4; // 0x1E4
	int unknown1E8; // 0x1E8
	int unknown1EC; // 0x1EC
	int unknown1F0; // 0x1F0
	int unknown1F4; // 0x1F4
	int unknown1F8; // 0x1F8
	int unknown1FC; // 0x1FC
	int unknown200; // 0x200
	int unknown204; // 0x204
	int unknown208; // 0x208
	int unknown20C; // 0x20C
	int unknown210; // 0x210
	int unknown214; // 0x214
	int unknown218; // 0x218
	int unknown21C; // 0x21C
	int unknown220; // 0x220
	int unknown224; // 0x224
	int unknown228; // 0x228
	int unknown22C; // 0x22C
	int unknown230; // 0x230
	int unknown234; // 0x234
	int unknown238; // 0x238
	int unknown23C; // 0x23C
	int unknown240; // 0x240
	int unknown244; // 0x244
	int unknown248; // 0x248
	int unknown24C; // 0x24C
	int unknown250; // 0x250
	int unknown254; // 0x254
	int unknown258; // 0x258
	int unknown25C; // 0x25C
	int unknown260; // 0x260
	int unknown264; // 0x264
	int unknown268; // 0x268
	int unknown26C; // 0x26C
	int unknown270; // 0x270
	int unknown274; // 0x274
	int unknown278; // 0x278
	int unknown27C; // 0x27C
	int unknown280; // 0x280
	int unknown284; // 0x284
	int unknown288; // 0x288
	int unknown28C; // 0x28C
	int unknown290; // 0x290
	int unknown294; // 0x294
	int unknown298; // 0x298
	int unknown29C; // 0x29C
	int unknown2A0; // 0x2A0
	int unknown2A4; // 0x2A4
	int unknown2A8; // 0x2A8
	int unknown2AC; // 0x2AC
	int unknown2B0; // 0x2B0
	int unknown2B4; // 0x2B4
	int unknown2B8; // 0x2B8
	int unknown2BC; // 0x2BC
	int unknown2C0; // 0x2C0
	int unknown2C4; // 0x2C4
	int unknown2C8; // 0x2C8
	int unknown2CC; // 0x2CC
	int unknown2D0; // 0x2D0
	int unknown2D4; // 0x2D4
	int unknown2D8; // 0x2D8
	int unknown2DC; // 0x2DC
	int unknown2E0; // 0x2E0
	int unknown2E4; // 0x2E4
	int unknown2E8; // 0x2E8
	int unknown2EC; // 0x2EC
	int unknown2F0; // 0x2F0
	int unknown2F4; // 0x2F4
	int unknown2F8; // 0x2F8
	int unknown2FC; // 0x2FC
	int unknown300; // 0x300
	int unknown304; // 0x304
	int unknown308; // 0x308
	int unknown30C; // 0x30C
	int unknown310; // 0x310
	int unknown314; // 0x314
	int unknown318; // 0x318
	int unknown31C; // 0x31C
	int unknown320; // 0x320
	int unknown324; // 0x324
	int unknown328; // 0x328
	int unknown32C; // 0x32C
	int unknown330; // 0x330
	int unknown334; // 0x334
	int unknown338; // 0x338
	int unknown33C; // 0x33C
	int unknown340; // 0x340
	int unknown344; // 0x344
	int unknown348; // 0x348
	int unknown34C; // 0x34C
	int unknown350; // 0x350
	int unknown354; // 0x354
	int unknown358; // 0x358
	int unknown35C; // 0x35C
	int unknown360; // 0x360
	int unknown364; // 0x364
	int unknown368; // 0x368
	int unknown36C; // 0x36C
	int unknown370; // 0x370
	int unknown374; // 0x374
	int unknown378; // 0x378
	int unknown37C; // 0x37C
	int unknown380; // 0x380
	int unknown384; // 0x384
	int unknown388; // 0x388
	int unknown38C; // 0x38C
	int unknown390; // 0x390
	int unknown394; // 0x394
	int unknown398; // 0x398
	int unknown39C; // 0x39C
	int unknown3A0; // 0x3A0
	int unknown3A4; // 0x3A4
	int unknown3A8; // 0x3A8
	int unknown3AC; // 0x3AC
	int unknown3B0; // 0x3B0
	int unknown3B4; // 0x3B4
	int unknown3B8; // 0x3B8
	int unknown3BC; // 0x3BC
	int unknown3C0; // 0x3C0
	int unknown3C4; // 0x3C4
	int unknown3C8; // 0x3C8
	int unknown3CC; // 0x3CC
	int unknown3D0; // 0x3D0
	int unknown3D4; // 0x3D4
	int unknown3D8; // 0x3D8
	int unknown3DC; // 0x3DC
	int unknown3E0; // 0x3E0
	int unknown3E4; // 0x3E4
	int unknown3E8; // 0x3E8
	int unknown3EC; // 0x3EC
	int unknown3F0; // 0x3F0
	int unknown3F4; // 0x3F4
	int unknown3F8; // 0x3F8
	int unknown3FC; // 0x3FC
	int unknown400; // 0x400
	int unknown404; // 0x404
	int unknown408; // 0x408
	int unknown40C; // 0x40C
	int unknown410; // 0x410
	int unknown414; // 0x414
	int unknown418; // 0x418
	int unknown41C; // 0x41C
	int unknown420; // 0x420
	int unknown424; // 0x424
	int unknown428; // 0x428
	int unknown42C; // 0x42C
	int unknown430; // 0x430
	int unknown434; // 0x434
	int unknown438; // 0x438
	int unknown43C; // 0x43C
	int unknown440; // 0x440
	int unknown444; // 0x444
	int unknown448; // 0x448
	int unknown44C; // 0x44C
	int unknown450; // 0x450
	int unknown454; // 0x454
	int unknown458; // 0x458
	int unknown45C; // 0x45C
	int unknown460; // 0x460
	int unknown464; // 0x464
	int unknown468; // 0x468
	int unknown46C; // 0x46C
	int unknown470; // 0x470
	int unknown474; // 0x474
	int unknown478; // 0x478
	int unknown47C; // 0x47C
	int unknown480; // 0x480
	int unknown484; // 0x484
	int unknown488; // 0x488
	int unknown48C; // 0x48C
	int unknown490; // 0x490
	int unknown494; // 0x494
	int unknown498; // 0x498
	int unknown49C; // 0x49C
	int unknown4A0; // 0x4A0
	int unknown4A4; // 0x4A4
	int unknown4A8; // 0x4A8
	int unknown4AC; // 0x4AC
	int unknown4B0; // 0x4B0
	int unknown4B4; // 0x4B4
	int unknown4B8; // 0x4B8
	int unknown4BC; // 0x4BC
	int unknown4C0; // 0x4C0
	int unknown4C4; // 0x4C4
	int unknown4C8; // 0x4C8
	int unknown4CC; // 0x4CC
	int unknown4D0; // 0x4D0
	int unknown4D4; // 0x4D4
	int unknown4D8; // 0x4D8
	int unknown4DC; // 0x4DC
	int unknown4E0; // 0x4E0
	int unknown4E4; // 0x4E4
	int unknown4E8; // 0x4E8
	int unknown4EC; // 0x4EC
	int unknown4F0; // 0x4F0
	int unknown4F4; // 0x4F4
	int unknown4F8; // 0x4F8
	int unknown4FC; // 0x4FC
	int unknown500; // 0x500
	int unknown504; // 0x504
	int unknown508; // 0x508
	int unknown50C; // 0x50C
	int unknown510; // 0x510
	int unknown514; // 0x514
	int unknown518; // 0x518
	int unknown51C; // 0x51C
	int unknown520; // 0x520
	int unknown524; // 0x524
	int unknown528; // 0x528
	int unknown52C; // 0x52C
	int unknown530; // 0x530
	int unknown534; // 0x534
	int unknown538; // 0x538
	int unknown53C; // 0x53C
	int unknown540; // 0x540
	int unknown544; // 0x544
	int unknown548; // 0x548
	int unknown54C; // 0x54C
	int unknown550; // 0x550
	int unknown554; // 0x554
	int unknown558; // 0x558
	int unknown55C; // 0x55C
	int unknown560; // 0x560
	int unknown564; // 0x564
	int unknown568; // 0x568
	int unknown56C; // 0x56C
	int unknown570; // 0x570
	int unknown574; // 0x574
	int unknown578; // 0x578
	int unknown57C; // 0x57C
	int unknown580; // 0x580
	int unknown584; // 0x584
	int unknown588; // 0x588
	int unknown58C; // 0x58C
	int unknown590; // 0x590
	int unknown594; // 0x594
	int unknown598; // 0x598
	int unknown59C; // 0x59C
	int unknown5A0; // 0x5A0
	int unknown5A4; // 0x5A4
	int unknown5A8; // 0x5A8
	int unknown5AC; // 0x5AC
	int unknown5B0; // 0x5B0
	int unknown5B4; // 0x5B4
	int unknown5B8; // 0x5B8
	int unknown5BC; // 0x5BC
	int unknown5C0; // 0x5C0
	int unknown5C4; // 0x5C4
	int unknown5C8; // 0x5C8
	int unknown5CC; // 0x5CC
	int unknown5D0; // 0x5D0
	int unknown5D4; // 0x5D4
	int unknown5D8; // 0x5D8
	int unknown5DC; // 0x5DC
	int unknown5E0; // 0x5E0
	int unknown5E4; // 0x5E4
	int unknown5E8; // 0x5E8
	int unknown5EC; // 0x5EC
	int unknown5F0; // 0x5F0
	int unknown5F4; // 0x5F4
	int unknown5F8; // 0x5F8
	int unknown5FC; // 0x5FC
	int unknown600; // 0x600
	int unknown604; // 0x604
	int unknown608; // 0x608
	int unknown60C; // 0x60C
	int unknown610; // 0x610
	int unknown614; // 0x614
	int unknown618; // 0x618
	int unknown61C; // 0x61C
	int unknown620; // 0x620
	int unknown624; // 0x624
	int unknown628; // 0x628
	int unknown62C; // 0x62C
	int unknown630; // 0x630
	int unknown634; // 0x634
	int unknown638; // 0x638
	int unknown63C; // 0x63C
	int unknown640; // 0x640
	int unknown644; // 0x644
	int unknown648; // 0x648
	int unknown64C; // 0x64C
	int unknown650; // 0x650
	int unknown654; // 0x654
	int unknown658; // 0x658
	int unknown65C; // 0x65C
	int unknown660; // 0x660
	int unknown664; // 0x664
	int unknown668; // 0x668
	int unknown66C; // 0x66C
	int unknown670; // 0x670
	int unknown674; // 0x674
	int unknown678; // 0x678
	int unknown67C; // 0x67C
	int unknown680; // 0x680
	int unknown684; // 0x684
	int unknown688; // 0x688
	int unknown68C; // 0x68C
	int unknown690; // 0x690
	int unknown694; // 0x694
	int unknown698; // 0x698
	int unknown69C; // 0x69C
	int unknown6A0; // 0x6A0
	int unknown6A4; // 0x6A4
	int unknown6A8; // 0x6A8
	int unknown6AC; // 0x6AC
	int unknown6B0; // 0x6B0
	int unknown6B4; // 0x6B4
	int unknown6B8; // 0x6B8
	int unknown6BC; // 0x6BC
	int unknown6C0; // 0x6C0
	int unknown6C4; // 0x6C4
	int unknown6C8; // 0x6C8
	int unknown6CC; // 0x6CC
	int unknown6D0; // 0x6D0
	int unknown6D4; // 0x6D4
	int unknown6D8; // 0x6D8
	int unknown6DC; // 0x6DC
	int unknown6E0; // 0x6E0
	int unknown6E4; // 0x6E4
	int unknown6E8; // 0x6E8
	int unknown6EC; // 0x6EC
	int unknown6F0; // 0x6F0
	int unknown6F4; // 0x6F4
	int unknown6F8; // 0x6F8
	int unknown6FC; // 0x6FC
	int unknown700; // 0x700
	int unknown704; // 0x704
	int unknown708; // 0x708
	int unknown70C; // 0x70C
	int unknown710; // 0x710
	int unknown714; // 0x714
	int unknown718; // 0x718
	int unknown71C; // 0x71C
	int unknown720; // 0x720
	int unknown724; // 0x724
	int unknown728; // 0x728
	int unknown72C; // 0x72C
	int unknown730; // 0x730
	int unknown734; // 0x734
	int unknown738; // 0x738
	int unknown73C; // 0x73C
	int unknown740; // 0x740
	int unknown744; // 0x744
	int unknown748; // 0x748
	int unknown74C; // 0x74C
	int unknown750; // 0x750
	int unknown754; // 0x754
	int unknown758; // 0x758
	int unknown75C; // 0x75C
	int unknown760; // 0x760
	int unknown764; // 0x764
	int unknown768; // 0x768
	int unknown76C; // 0x76C
	int unknown770; // 0x770
	int unknown774; // 0x774
	int unknown778; // 0x778
	int unknown77C; // 0x77C
	int unknown780; // 0x780
	int unknown784; // 0x784
	int unknown788; // 0x788
	int unknown78C; // 0x78C
	int unknown790; // 0x790
	int unknown794; // 0x794
	int unknown798; // 0x798
	int unknown79C; // 0x79C
	int unknown7A0; // 0x7A0
	int unknown7A4; // 0x7A4
	int unknown7A8; // 0x7A8
	int unknown7AC; // 0x7AC
	int unknown7B0; // 0x7B0
	int unknown7B4; // 0x7B4
	int unknown7B8; // 0x7B8
	int unknown7BC; // 0x7BC
	int unknown7C0; // 0x7C0
	int unknown7C4; // 0x7C4
	int unknown7C8; // 0x7C8
	int unknown7CC; // 0x7CC
	int unknown7D0; // 0x7D0
	int unknown7D4; // 0x7D4
	int unknown7D8; // 0x7D8
	int unknown7DC; // 0x7DC
	int unknown7E0; // 0x7E0
	int unknown7E4; // 0x7E4
	int unknown7E8; // 0x7E8
	int unknown7EC; // 0x7EC
	int unknown7F0; // 0x7F0
	int unknown7F4; // 0x7F4
	int unknown7F8; // 0x7F8
	int unknown7FC; // 0x7FC
	int unknown800; // 0x800
	int unknown804; // 0x804
	int unknown808; // 0x808
	int unknown80C; // 0x80C
	int unknown810; // 0x810
	int unknown814; // 0x814
	int unknown818; // 0x818
	int unknown81C; // 0x81C
	int unknown820; // 0x820
	int unknown824; // 0x824
	int unknown828; // 0x828
	int unknown82C; // 0x82C
	int unknown830; // 0x830
	int unknown834; // 0x834
	int unknown838; // 0x838
	int unknown83C; // 0x83C
	int unknown840; // 0x840
	int unknown844; // 0x844
	int unknown848; // 0x848
	int unknown84C; // 0x84C
	int unknown850; // 0x850
	int unknown854; // 0x854
	int unknown858; // 0x858
	int unknown85C; // 0x85C
	int unknown860; // 0x860
	int unknown864; // 0x864
	int unknown868; // 0x868
	int unknown86C; // 0x86C
	int unknown870; // 0x870
	int unknown874; // 0x874
	int unknown878; // 0x878
	int unknown87C; // 0x87C
	int unknown880; // 0x880
	int unknown884; // 0x884
	int unknown888; // 0x888
	int unknown88C; // 0x88C
	int unknown890; // 0x890
	int unknown894; // 0x894
	int unknown898; // 0x898
	int unknown89C; // 0x89C
	int unknown8A0; // 0x8A0
	int unknown8A4; // 0x8A4
	int unknown8A8; // 0x8A8
	int unknown8AC; // 0x8AC
	int unknown8B0; // 0x8B0
	int unknown8B4; // 0x8B4
	int unknown8B8; // 0x8B8
	int unknown8BC; // 0x8BC
	int unknown8C0; // 0x8C0
	int unknown8C4; // 0x8C4
	int unknown8C8; // 0x8C8
	int unknown8CC; // 0x8CC
	int unknown8D0; // 0x8D0
	int unknown8D4; // 0x8D4
	int unknown8D8; // 0x8D8
	int unknown8DC; // 0x8DC
	int unknown8E0; // 0x8E0
	int unknown8E4; // 0x8E4
	int unknown8E8; // 0x8E8
	int unknown8EC; // 0x8EC
	int unknown8F0; // 0x8F0
	int unknown8F4; // 0x8F4
	int unknown8F8; // 0x8F8
	int unknown8FC; // 0x8FC
	int unknown900; // 0x900
	int unknown904; // 0x904
	int unknown908; // 0x908
	int unknown90C; // 0x90C
	int unknown910; // 0x910
	int unknown914; // 0x914
	int unknown918; // 0x918
	int unknown91C; // 0x91C
	int unknown920; // 0x920
	int unknown924; // 0x924
	int unknown928; // 0x928
	int unknown92C; // 0x92C
	int unknown930; // 0x930
	int unknown934; // 0x934
	int unknown938; // 0x938
	int unknown93C; // 0x93C
	int unknown940; // 0x940
	int unknown944; // 0x944
	int unknown948; // 0x948
	int unknown94C; // 0x94C
	int unknown950; // 0x950
	int unknown954; // 0x954
	int unknown958; // 0x958
	int unknown95C; // 0x95C
	int unknown960; // 0x960
	int unknown964; // 0x964
	int unknown968; // 0x968
	int unknown96C; // 0x96C
	int unknown970; // 0x970
	int unknown974; // 0x974
	int unknown978; // 0x978
	int unknown97C; // 0x97C
	int unknown980; // 0x980
	int unknown984; // 0x984
	int unknown988; // 0x988
	int unknown98C; // 0x98C
	int unknown990; // 0x990
	int unknown994; // 0x994
	int unknown998; // 0x998
	int unknown99C; // 0x99C
	int unknown9A0; // 0x9A0
	int unknown9A4; // 0x9A4
	int unknown9A8; // 0x9A8
	int unknown9AC; // 0x9AC
	int unknown9B0; // 0x9B0
	int unknown9B4; // 0x9B4
	int unknown9B8; // 0x9B8
	int unknown9BC; // 0x9BC
	int unknown9C0; // 0x9C0
	int unknown9C4; // 0x9C4
	int unknown9C8; // 0x9C8
	int unknown9CC; // 0x9CC
	int unknown9D0; // 0x9D0
	int unknown9D4; // 0x9D4
	int unknown9D8; // 0x9D8
	int unknown9DC; // 0x9DC
	int unknown9E0; // 0x9E0
	int unknown9E4; // 0x9E4
	int unknown9E8; // 0x9E8
	int unknown9EC; // 0x9EC
	int unknown9F0; // 0x9F0
	int unknown9F4; // 0x9F4
	int unknown9F8; // 0x9F8
	int unknown9FC; // 0x9FC
	int unknownA00; // 0xA00
	int unknownA04; // 0xA04
	int unknownA08; // 0xA08
	int unknownA0C; // 0xA0C
	int unknownA10; // 0xA10
	int unknownA14; // 0xA14
	int unknownA18; // 0xA18
	int unknownA1C; // 0xA1C
	int unknownA20; // 0xA20
	int unknownA24; // 0xA24
	int unknownA28; // 0xA28
	int unknownA2C; // 0xA2C
	int unknownA30; // 0xA30
	int unknownA34; // 0xA34
	int unknownA38; // 0xA38
	int unknownA3C; // 0xA3C
	int unknownA40; // 0xA40
	int unknownA44; // 0xA44
	int unknownA48; // 0xA48
	int unknownA4C; // 0xA4C
	int unknownA50; // 0xA50
	int unknownA54; // 0xA54
	int unknownA58; // 0xA58
	int unknownA5C; // 0xA5C
	int unknownA60; // 0xA60
	int unknownA64; // 0xA64
	int unknownA68; // 0xA68
	int unknownA6C; // 0xA6C
	int unknownA70; // 0xA70
	int unknownA74; // 0xA74
	int unknownA78; // 0xA78
	int unknownA7C; // 0xA7C
	int unknownA80; // 0xA80
	int unknownA84; // 0xA84
	int unknownA88; // 0xA88
	int unknownA8C; // 0xA8C
	int unknownA90; // 0xA90
	int unknownA94; // 0xA94
	int unknownA98; // 0xA98
	int unknownA9C; // 0xA9C
	int unknownAA0; // 0xAA0
	int unknownAA4; // 0xAA4
	int unknownAA8; // 0xAA8
	int unknownAAC; // 0xAAC
	int unknownAB0; // 0xAB0
	int unknownAB4; // 0xAB4
	int unknownAB8; // 0xAB8
	int unknownABC; // 0xABC
	int unknownAC0; // 0xAC0
	int unknownAC4; // 0xAC4
	int unknownAC8; // 0xAC8
	int unknownACC; // 0xACC
	int unknownAD0; // 0xAD0
	int unknownAD4; // 0xAD4
	int unknownAD8; // 0xAD8
	int unknownADC; // 0xADC
	int unknownAE0; // 0xAE0
	int unknownAE4; // 0xAE4
	int unknownAE8; // 0xAE8
	int unknownAEC; // 0xAEC
	int unknownAF0; // 0xAF0
	int unknownAF4; // 0xAF4
	int unknownAF8; // 0xAF8
	int unknownAFC; // 0xAFC
	int unknownB00; // 0xB00
	int unknownB04; // 0xB04
	int unknownB08; // 0xB08
	int unknownB0C; // 0xB0C
	int unknownB10; // 0xB10
	int unknownB14; // 0xB14
	int unknownB18; // 0xB18
	int unknownB1C; // 0xB1C
	int unknownB20; // 0xB20
	int unknownB24; // 0xB24
	int unknownB28; // 0xB28
	int unknownB2C; // 0xB2C
	int unknownB30; // 0xB30
	int unknownB34; // 0xB34
	int unknownB38; // 0xB38
	int unknownB3C; // 0xB3C
	int unknownB40; // 0xB40
	int unknownB44; // 0xB44
	int unknownB48; // 0xB48
	int unknownB4C; // 0xB4C
	int unknownB50; // 0xB50

	static int install(SignatureScanner & signatureScanner, module mod);
};


#endif //WKJELLYWORM_CTASKSPRITEANIMATION_H
